# StairstypeNotchExtension Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeNotchExtension Property
ParameterTypeId Class See Also
---
"Notch Extension":
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeNotchExtension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeNotchExtension As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeNotchExtension {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace